iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_Periph_Driver/src/tmpm475_enc.c
/**
  * @brief  Set PWM stop noise cancel counter
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @param  StopState: Select the cancel counter mode.
  *   This parameter can be one of the following values:
  *   ENC_PWM_COUNT_STOP or ENC_PWM_COUNT_STOP_CLEAR.    
  * @retval Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  * @register The used register:
  *   ENCINPCR<SYNCNCZEN>
  */
Result ENC_SetPWMStop(TSB_EN_TypeDef * ENx, uint32_t StopState)
{
    uint32_t tmp = 0U;
    uint32_t result1 = ENC_PWM_SAMPLE_DISABLE;
    uint32_t result2 = ENC_PWM_OFF_EDGE;
    Result retval = ERROR;
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    assert_param(IS_ENC_PWM_COUNTMD(StopState));
    /* Get PWM Sample Mode */
    result1 = ENC_GetSampleMode(ENx);
    result2 = ENC_GetPWMSampleMode(ENx);
    /* Set PWM stop counter */
    if ((result1 == ENC_PWM_SAMPLE_ENABLE) && (result2 == ENC_PWM_ON_PERIOD)) {
        tmp = ENx->INPCR;
        tmp &= ENINPCR_SYNCNCZEN_MASK;
        tmp |= StopState << 2U;
        ENx->INPCR = tmp;
        retval = SUCCESS;
    } else {
        /* Do nothing  */
    }
    return retval;
}

/**
  * @brief  Set the positiondetection stop command(sensor mode (at timer count/at phase count))
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @retval  Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  * @register The used register:
  *   ENCINPCR<PDSTP>
  */
Result ENC_StopPositionDetection(TSB_EN_TypeDef * ENx)
{
    uint32_t tmp = 0U;
    uint32_t mode = 0U;
    Result retval = ERROR;
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    /* Get operation mode */
    mode = ENC_GetControlMode(ENx);
    /* Sets the positiondetection stop command */
    if ((mode == ENC_SENSOR_TIME_MODE) || (mode == ENC_SENSOR_PHASE_MODE)) {
        tmp = ENx->INPCR;
        tmp |= ENINPCR_PDSTP_SET;
        ENx->INPCR = tmp;
        retval = SUCCESS;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Set the positiondetection start command(sensor mode (at timer count/at phase count))
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @retval  Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  * @register The used register:
  *   ENCINPCR<PDSTT>
  */
Result ENC_StartPositionDetection(TSB_EN_TypeDef * ENx)
{
    uint32_t tmp = 0U;
    uint32_t mode = 0U;
    Result retval = ERROR;
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    /* Get operation mode */
    mode = ENC_GetControlMode(ENx);
    /* Sets the positiondetection start command */
    if ((mode == ENC_SENSOR_TIME_MODE) || (mode == ENC_SENSOR_PHASE_MODE)) {
        tmp = ENx->INPCR;
        tmp |= ENINPCR_PDSTT_SET;
        ENx->INPCR = tmp;
        retval = SUCCESS;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Set sample disable period
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1. 
  * @param  DelayValue: set sampling disaible period.
  *   This parameter can be one of the following values:
  *   0x00U-0xffU.
  * @retval None.
  * @register The used register:
  *   ENCSMPDLY<SMPDLY[7:0]>
  */
void ENC_SetSampleDelay(TSB_EN_TypeDef * ENx, uint32_t DelayValue)
{
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    assert_param(IS_ENC_8BITVALUE(DelayValue));
    /* set the sample delay value */
    ENx->SMPDLY = DelayValue;
}

/**
  * @brief  Get Input Monitor Status
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1. 
  * @retval Input Status of value.
  * @register The used register:
  *   ENCINPMON<SMPDLYZ><SMPDLYB><SMPDLYA>
  */
ENC_InputStatus ENC_GetInputStatus(TSB_EN_TypeDef * ENx)
{
    ENC_InputStatus value = { 0U };
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    /*get input monitor value */
    value.All = ENx->INPMON;
    return value;
}

/**
  * @brief  Get Input Monitor Position 
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1. 
  * @retval  Input Position of value.
  * @register The used register:
  *   ENCINPMON<DETMONZ><DETMONB><DETMONA>
  */
ENC_InputPosition ENC_GetInputPosition(TSB_EN_TypeDef * ENx)
{
    ENC_InputPosition value = { 0U };
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    /*get input monitor value */
    value.All = ENx->INPMON;
    return value;
}

/**
  * @brief  Sets the sampling frequency 
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @param  SampleClk: Sample Clock
  *   This parameter can be one of the following values:
  *   ENC_SAMPLE_CLK_FSYS_1,ENC_SAMPLE_CLK_FSYS_2,ENC_SAMPLE_CLK_FSYS_4,
  *   ENC_SAMPLE_CLK_FSYS_8
  * @retval None.
  * @register The used register:
  *   ENCCLKCR<SPLCKS[1:0]>
  */
void ENC_SetSampleClk(TSB_EN_TypeDef * ENx, uint32_t SampleClk)
{
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    assert_param(IS_ENC_FSYS_FACTOR(SampleClk));
    /* set sample clock   */
    ENx->CLKCR = SampleClk;
}

/**
  * @brief  Set Interrupt Control 
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @patam  INTSrc: interrupt state
  *   This parameter can be one of the following values: 
  *   ENC_INTERRUPT_TPLS,ENC_INTERRUPT_CAP,ENC_INTERRUPT_ERR,
  *   ENC_INTERRUPT_CMP,ENC_INTERRUPT_RID,ENC_INTERRUPT_MCMP,
  *   ENC_INTERRUPT_ALL or combination of the effective bits.
  * @param  NewState: disabled or enable the interrupt of channel 
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE        
  * @retval None.
  * @register The used register:
  *   ENCINTCR<MCMPIE><RLDIE><CMPIE><ERRIE><CAPIE><TPLSIE>
  */
void ENC_SetINTControl(TSB_EN_TypeDef * ENx, uint32_t INTSrc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    assert_param(IS_ENC_INT_STATUS(INTSrc));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    /* set counter Intcr   */
    if (NewState == ENABLE) {
        /* Interrupt is enabled */
        ENx->INTCR |= INTSrc;
    } else {
        /* Interrupt is disabled */
        ENx->INTCR &= ~INTSrc;
    }
}

/**
  * @brief  Get the Interrupt Event Flag
  * @param  ENx: Select the encoder channel.
  *   This parameter can be one of the following values:
  *   EN0, EN1.
  * @retval Interrupt Event Flag of value.
  * @register The used register:
  *   ENCINTF<MCMPF><RLDCPF><INTCPF><ERRF><CAPF><TPLSF>
  */
ENC_INTFlag ENC_GetINTFlag(TSB_EN_TypeDef * ENx)
{
    ENC_INTFlag tmp = { 0U };
    /* Check the parameters */
    assert_param(IS_ENC_PERIPH(ENx));
    /* Get the  flag */
    tmp.All = ENx->INTF;
    return tmp;
}

/** @} */
/* End of group ENC_Exported_Functions */

/** @} */
/* End of group ENC */

/** @} */
/* End of group TX04_Periph_Driver */

#endif                          /* defined(__TMPM475_ENC_H) */
